# Data Manipulation with Pandas - Part 2

<p><b>About :</b> Setelah sudah mengenal lebih tentang Pandas, melakukan indexing, slicing dan transformasi di bagian sebelumnya,  di bagian ini kamu akan belajar lebih dalam seputar fungsional Pandas secara advance, mencakup menggabungkan beberapa dataframe, memformat ulang bentuk data agar data siap untuk dilakukan proses selanjutnya (analisis/prediksi), menerapkan teknik pengelompokan untuk mengurangi jumlah data, mengenal time series di Pandas dan tentunya project akhir yang mencakup semua materi.</p>

<p><b>Course :</b> <a href=https://academy.dqlab.id/main/package/practice/252?pf=0>Data Manipulation with Pandas - Part 2</a></p>

<h2>Module Content:</h2>

<div class="alert alert-block alert-info" style="margin-top: 20px">
    <ul>
        <li><a href="#penggabungan-series-dataframe">Penggabungan Series/Dataframe</a></li>
        <ul>
            <li><a href="#append">Append</a></li>
            <li><a href="#concat">Concat</a></li>
            <li><a href="#merge">Merge</a></li>
            <li><a href="#join">Join</a></li>
        </ul>
        <li><a href="#pivot-melt-stack-unstack">Pivot, Melt, Stack & Unstack</a></li>
        <ul>
            <li><a href="#"></a></li>
            <li><a href="#"></a></li>
        </ul>
        <li><a href="#aggregation-groupby">Aggregation & GroupBy</a></li>
        <ul>
            <li><a href="#"></a></li>
            <li><a href="#"></a></li>
        </ul>
        <li><a href="#time-series-pandas">Time Series in Pandas</a></li>
        <ul>
            <li><a href="#"></a></li>
            <li><a href="#"></a></li>
        </ul>
        <li><a href="#mini-quiz">Mini Quiz</a></li>
    </ul>
</div>

<h2><a name="penggabungan-series-dataframe"></a>Chapter 1: Penggabungan Series/Dataframe</h2>

<b>Reference:</b> <a href=https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html</a>

<p>Sebagai seorang praktisi data, pasti sering kali bertemu dengan banyak file sekaligus dan data yang dibutuhkan tersebar di berbagai file tersebut dan membutuhkan metode untuk menggabungkan semua informasi yang dibutuhkan dari setiap file itu.</p>

<p>Dengan menggunakan excel atau tools pengolah spreadsheet lain hal itu bisa terjadi mungkin dengan menggunakan copy paste file satu ke file lainnya atau yang agak canggih menggunakan method importRange di google sheets. Tetapi tentu hal itu tidak bisa diandalkan ketika berurusan dengan big data yang datanya bisa milyaran rows dengan informasi yang tidak terbatas, Python dan Pandas adalah satu-satunya cara untuk mengatasinya.</p>

<p>Terdapat beberapa metode untuk menggabungkan Series/Dataframe di Pandas, yaitu: <b>append</b>, <b>concat</b>, <b>merge</b>, <b>join</b>.</p>

<h3><a name="append"></a>Append</h3>

Method <code>.append()</code> dapat digunakan pada dataframe/series yang ditujukan untuk <b>menambah row</b>-nya saja. Jika di SQL memiliki 2 tabel atau lebih maka dapat menggabungkannya secara vertikal dengan Union. Jadi <b>SQL Union</b> ekuivalen dengan method <code>.append()</code> di Pandas.

In [11]:
import pandas as pd

# Buat series of int (s1) dan series of string (s2)
s1 = pd.Series([1,2,3,4,5,6])
s2 = pd.Series(["a","b","c","d","e","f"])

# Terapkan method append
s2_append_s1 = s2.append(s1)
print("Series - append:\n", s2_append_s1)

Series - append:
 0    a
1    b
2    c
3    d
4    e
5    f
0    1
1    2
2    3
3    4
4    5
5    6
dtype: object

In [12]:
# Buat dataframe df1 dan df2
df1 = pd.DataFrame({'a':[1,2],
                    'b':[3,4]})
df2 = pd.DataFrame({'b':[1,2],
                    'a':[3,4]})

# Terapkan method append
df2_append_df1 = df2.append(df1)
print("Dataframe - append:\n")
df2_append_df1

Dataframe - append:

   b  a
0  1  3
1  2  4
0  3  1
1  4  2

<h3><a name="concat"></a>Concat</h3>

Method <code>.concat()</code> dapat digunakan pada dataframe yang ditujukan untuk penggabungan baik dalam row-wise (dalam arah ) atau column-wise.

In [3]:
import pandas as pd

# Buat dataframe df1 dan df2
df1 = pd.DataFrame({'a':[1,2],
                    'b':[3,4]})
df2 = pd.DataFrame({'b':[1,2],
                    'a':[3,4]})

In [8]:
# Terapkan method concat row-wise
row_wise_concat = pd.concat([df2, df1])
row_wise_concat

   b  a
0  1  3
1  2  4
0  3  1
1  4  2

In [9]:
# Terapkan method concat column-wise
col_wise_concat = pd.concat([df2, df1], axis=1)
col_wise_concat

   b  a  a  b
0  1  3  1  3
1  2  4  2  4

In [10]:
# Penambahan identifier --> membentuk hasil penggabungan multiindex
multiindex_concat = pd.concat([df2,df1], axis=0, keys=['df1','df2'])
multiindex_concat

       b  a
df1 0  1  3
    1  2  4
df2 0  3  1
    1  4  2

<h3><a name="merge"></a>Merge</h3>

Method <code>.merge()</code> untuk menggabungkan Series/Dataframe yang bentuknya mirip dengan syntax <b>join di SQL</b>, specify left and right tables, join key dan how to join (left, right, inner, full outer).

In [13]:
import pandas as pd

# Buat dataframe df1 dan df2
df1 = pd.DataFrame({
   'key':['k1','k2','k3','k4','k5'],
   'val1':[200, 500, 0, 500, 100],
   'val2':[30, 50, 100, 20, 10]})
df2 = pd.DataFrame({
   'key':['k1','k3','k5','k7','k10'],
   'val3':[1,2,3,4,5],
   'val4':[6,7,8,8,10]})

<code>pd.merge</code> yang ekivalen dengan <b>SQL left join</b> menggunakan <b><code>how='left'</code></b>

In [14]:
# Merge yang ekivalen dengan SQL left join
merge_df_left = pd.merge(left=df2, right=df1, how='left', left_on='key', right_on='key')
merge_df_left

   key  val3  val4   val1   val2
0   k1     1     6  200.0   30.0
1   k3     2     7    0.0  100.0
2   k5     3     8  100.0   10.0
3   k7     4     8    NaN    NaN
4  k10     5    10    NaN    NaN

<code>pd.merge</code> yang ekivalen dengan <b>SQL right join</b> menggunakan <b><code>how='right'</code></b>

In [15]:
# Merge yang ekivalen dengan SQL right join
merge_df_right = pd.merge(left=df2, right=df1, how='right', left_on='key', right_on='key')
merge_df_right

  key  val3  val4  val1  val2
0  k1   1.0   6.0   200    30
1  k3   2.0   7.0     0   100
2  k5   3.0   8.0   100    10
3  k2   NaN   NaN   500    50
4  k4   NaN   NaN   500    20

<code>pd.merge</code> yang ekivalen dengan <b>SQL inner join</b> menggunakan <b><code>how='inner'</code></b>

In [16]:
# Merge yang ekivalen dengan SQL inner join
merge_df_inner = pd.merge(left=df2, right=df1, how='inner', left_on='key', right_on='key')
merge_df_inner

  key  val3  val4  val1  val2
0  k1     1     6   200    30
1  k3     2     7     0   100
2  k5     3     8   100    10

<code>pd.merge</code> yang ekivalen dengan <b>SQL outer join</b> menggunakan <b><code>how='outer'</code></b>

In [17]:
# Merge yang ekivalen dengan SQL outer join
merge_df_outer = pd.merge(left=df2, right=df1, how='outer', left_on='key', right_on='key')
merge_df_outer

   key  val3  val4   val1   val2
0   k1   1.0   6.0  200.0   30.0
1   k3   2.0   7.0    0.0  100.0
2   k5   3.0   8.0  100.0   10.0
3   k7   4.0   8.0    NaN    NaN
4  k10   5.0  10.0    NaN    NaN
5   k2   NaN   NaN  500.0   50.0
6   k4   NaN   NaN  500.0   20.0

<p>Penggunaan method <code>.merge</code> yang telah dipelajari diatas adalah untuk dataframe dengan <b>index tunggal</b>.</p>

<p>Bagaimana jika salah satu dataframe atau keseluruhan dataframe yang akan digabungkan tersebut memiliki <b>multiindex</b>?</p>

<p>Cara mengatasinya adalah dengan mereset index pada kedua dataframe, kemudian merge akan mendeteksi common single/multi column di kedua dataframe dan melakukan merge.</p>

In [22]:
import pandas as pd

# Buat dataframe df1 dan df2
df1 = pd.DataFrame({
   'key':['k1','k2','k3','k4','k5'],
   'val1':[200, 500, 0, 500, 100],
   'val2':[30, 50, 100, 20, 10]
}).set_index(['key','val2'])
df1

          val1
key val2
k1  30     200
k2  50     500
k3  100      0
k4  20     500
k5  10     100

In [23]:
df2 = pd.DataFrame({
   'key':['k1','k3','k5','k7','k10'],
   'val3':[1,2,3,4,5],
   'val4':[6,7,8,8,10]
}).set_index(['key','val3'])
df2

          val4
key val3
k1  1        6
k3  2        7
k5  3        8
k7  4        8
k10 5       10

In [24]:
# Merge dataframe yang memiliki multi index
df_merge = pd.merge(df1.reset_index(),df2.reset_index())
print('Merging dataframe:\n')
df_merge

Merging dataframe:

  key  val2  val1  val3  val4
0  k1    30   200     1     6
1  k3   100     0     2     7
2  k5    10   100     3     8

<h3><a name="join"></a>Join</h3>

Metthod <code>.join()</code> digunakan pada dataframe untuk menggabungkan kedua data dengan <b>set index</b> pada kedua tabel tersebut sebagai join key, tanpa index, hal ini tidak akan berhasil.

In [25]:
import pandas as pd
# Buat dataframe df1 dan df2
df1 = pd.DataFrame({
   'key':['k1','k2','k3','k4','k5'],
   'val1':[200, 500, 0, 500, 100],
   'val2':[30, 50, 100, 20, 10]
})
df2 = pd.DataFrame({
   'key':['k1','k3','k5','k7','k10'],
   'val3':[1,2,3,4,5],
   'val4':[6,7,8,8,10]
})
# Penerapan join dengan menggunakan set_index dan keyword how
join_df = df1.set_index('key').join(df2.set_index('key'), how='outer')
join_df

      val1   val2  val3  val4
key
k1   200.0   30.0   1.0   6.0
k10    NaN    NaN   5.0  10.0
k2   500.0   50.0   NaN   NaN
k3     0.0  100.0   2.0   7.0
k4   500.0   20.0   NaN   NaN
k5   100.0   10.0   3.0   8.0
k7     NaN    NaN   4.0   8.0

<b>Note:</b> Secara default, tanpa mendefiniskan <code>how</code>, fungsi join ini akan mengeksekusi <b>left join</b>.

<h2><a name="pivot-melt-stack-unstack"></a>Chapter 2: Pivot, Melt, Stack & Unstack</h2>

<h3><a name="read-dataset"></a>Read Dataset</h3>

<h2><a name="aggregation-groupby"></a>Chapter 3: Aggregation & GroupBy</h2>

<h3><a name="indexing"></a>Indexing</h3>

<h2><a name="time-series-pandas"></a>Chapter 4: Time Series in Pandas</h2>

<h2><a name="mini-quiz"></a>Chapter 5: Mini Quiz</h2>

<div style="border: 2px solid orange;border-radius: 5px;">
    <b style="color:orange;padding:10px">Project dari Andra</b>
    <div style="padding:25px">
        <p>Diberikan dataset <b>‘retail_raw_test.csv’</b>.</p>
        <ol>
            <li>Baca dataset</li>
            <li>Tipe data diubah menjadi tipe yang seharusnya</li>
            <ul>
                <li>customer_id dari string ke int64,</li>
                <li>quantity dari string ke int64,</li>
                <li>item_price dari string ke int64</li>
            </ul>
            <li>transform product_value supaya bentuknya seragam dengan format PXXXX, assign ke kolom baru "product_id", dan drop kolom "product_value", jika terdapat nan gantilah dengan "unknown".</li>
            <li>tranform order_date menjadi value dengan format YYYY-mm-dd</li>
            <li>cek data hilang dari tiap kolom dan kemudian isi missing value</li>
            <ul>
                <li>di brand dengan "no_brand", dan</li>
                <li>cek dulu bagaimana missing value di city & province - isi missing value di city dan province dengan "unknown"</li>
            </ul>
            <li>create column city/province dari gabungan city & province</li>
            <li>membuat index berdasarkan city_provice, order_date, customer_id, order_id, product_id (cek index)</li>
            <li>membuat kolom "total_price" sebagai hasil perkalian quantity dengan item_price</li>
            <li>slice data hanya untuk Jan 2019</li>
        </ol>
    </div>
</div>